; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 933765 2 2 2 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	infrared1 - mode
	Star1 - direction
	Star3 - direction
	GroundStation0 - direction
	Star2 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Star6)
	(have_image Phenomenon4 infrared1)
	(have_image Planet5 thermograph0)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 thermograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 star6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star6)
   goals met: 1 of 6
4. (turn_to satellite0 star2 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star2)
   goals met: 2 of 6
5. (turn_to satellite1 star2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star2)
   goals met: 1 of 6
6. (turn_to satellite0 groundstation0 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 6
7. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 6
8. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 6
9. (turn_to satellite1 phenomenon4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon4)
   goals met: 0 of 6
10. (turn_to satellite0 star2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star2)
   goals met: 1 of 6
11. (take_image satellite1 phenomenon4 instrument1 infrared1)
   added: (have_image phenomenon4 infrared1)
   goals met: 2 of 6
12. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   goals met: 1 of 6
13. (turn_to satellite1 star6 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star6)
   goals met: 2 of 6
14. (take_image satellite0 planet5 instrument0 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 3 of 6
15. (take_image satellite1 star6 instrument1 infrared1)
   added: (have_image star6 infrared1)
   goals met: 4 of 6
16. (turn_to satellite0 star2 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star2)
   goals met: 5 of 6
17. (turn_to satellite1 phenomenon7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 6
18. (take_image satellite1 phenomenon7 instrument1 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 5 of 6
19. (turn_to satellite1 star6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star6)
   goals met: 6 of 6
